Библиотека/src/Documents/ВводОстатковКниг/ВводОстатковКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковКниг</name>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоРазмещения</name>
      <type>
        <types>CatalogRef.Абоненты</types>
        <types>CatalogRef.МестаРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Enums/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Операция</name>
  <enumValues>
    <name>ПоступлениеКниг</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКнигиАбоненту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКнигиАбонентом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКниг</name>
  </enumValues>
</mdclass:Enum>

Библиотека/src/Documents/ВводОстатковКниг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверка проведения:
	//1. Проверить на повторяющиеся эелементы в ТЧ
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	//2. Проверить нет ли уже таких остатков в библиотеке
	ОбщегоНазначения.ПроверитьОстаткиНаОтсутствие(ЭтотОбъект, Отказ);
	//3. Проверить установлена ли дата выдачи если расположение у абонента
	ОбщегоНазначения.ПроверитьДатуВыдачи(ЭтотОбъект, Отказ);
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КнигиВБиблиотеке Приход
	Движения.КнигиВБиблиотеке.Записывать = Истина;
	Для Каждого ТекСтрокаКниги Из Книги Цикл		
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Количество = 1;
		Движение.Операция = Перечисления.Операция.ПоступлениеКниг;
		//Если размещение книги у абонента, то сделаем расход
		Если ТекСтрокаКниги.МестоРазмещения <> Справочники.МестаРазмещения.Библиотека Тогда   			
			//вычтим с библиотеки			
			Движение = Движения.КнигиВБиблиотеке.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрокаКниги.ДатаВыдачи;
			Движение.Книга = ТекСтрокаКниги.Книга;
			Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
			Движение.Количество = 1;
			Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;
			//и добавим абоненту
			Движение = Движения.КнигиВБиблиотеке.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТекСтрокаКниги.ДатаВыдачи;
			Движение.Книга = ТекСтрокаКниги.Книга;
			Движение.МестоРазмещения = ТекСтрокаКниги.МестоРазмещения;
			Движение.Количество = 1;
			Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;		
		КонецЕсли;
	КонецЦикла;	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
